zephyrproject-rtos/hal_nxp/mcux/mcux-sdk-ng/devices/RT/RT700/MIMXRT735S/startup_MIMXRT735S_cm33_core0.cpp
//*****************************************************************************
// MIMXRT735S_cm33_core0 startup code
//
// Version : 200525
//*****************************************************************************
//
// Copyright 2016-2025 NXP
//
// SPDX-License-Identifier: BSD-3-Clause
//*****************************************************************************
#include <stdint.h>

#if defined(DEBUG)
#if defined(__GNUC__)
#pragma GCC push_options
#pragma GCC optimize("Og")
#endif //(__GNUC__)
#endif //(DEBUG)

#if defined(__cplusplus)
#if defined(__MCUXPRESSO)
#if defined(__REDLIB__)
#error Redlib does not support C++
#else
//*****************************************************************************
//
// The entry point for the C++ library startup
//
//*****************************************************************************
extern "C" {
extern void __libc_init_array(void);
}
#endif //(__REDLIB__)
#endif //(__MCUXPRESSO)
#endif //(__cplusplus)

#define WEAK __attribute__((weak))
#if defined(__MCUXPRESSO)
#define WEAK_AV __attribute__((weak, section(".after_vectors")))
#else
#define WEAK_AV __attribute__((weak))
#endif //(__MCUXPRESSO)
#define ALIAS(f) __attribute__((weak, alias(#f)))

//*****************************************************************************
#if defined(__cplusplus)
extern "C" {
#endif //(__cplusplus)

//*****************************************************************************
// Variable to store CRP value in. Will be placed automatically
// by the linker when "Enable Code Read Protect" selected.
// See crp.h header for more information
//*****************************************************************************
//*****************************************************************************
// Declaration of external SystemInit function
//*****************************************************************************
extern void SystemInit(void);

//*****************************************************************************
// Forward declaration of the core exception handlers.
// When the application defines a handler (with the same name), this will
// automatically take precedence over these weak definitions.
// If your application is a C++ one, then any interrupt handlers defined
// in C++ files within in your main application will need to have C linkage
// rather than C++ linkage. To do this, make sure that you are using extern "C"
// { .... } around the interrupt handler within your main application code.
//*****************************************************************************
#if defined(__MCUXPRESSO)
void ResetISR(void);
#else
void Reset_Handler(void);
#endif //(__MCUXPRESSO)
WEAK void NMI_Handler(void);
WEAK void HardFault_Handler(void);
WEAK void MemManage_Handler(void);
WEAK void BusFault_Handler(void);
WEAK void UsageFault_Handler(void);
WEAK void SecureFault_Handler(void);
WEAK void SVC_Handler(void);
WEAK void DebugMon_Handler(void);
WEAK void PendSV_Handler(void);
WEAK void SysTick_Handler(void);
WEAK void DefaultISR(void);

//*****************************************************************************
// Forward declaration of the application IRQ handlers. When the application
// defines a handler (with the same name), this will automatically take
// precedence over weak definitions below
//*****************************************************************************
WEAK void Reserved16_IRQHandler(void);
WEAK void UTICK0_IRQHandler(void);
WEAK void MRT0_IRQHandler(void);
WEAK void CTIMER0_IRQHandler(void);
WEAK void CTIMER1_IRQHandler(void);
WEAK void SCT0_IRQHandler(void);
WEAK void CTIMER3_IRQHandler(void);
WEAK void LP_FLEXCOMM0_IRQHandler(void);
WEAK void LP_FLEXCOMM1_IRQHandler(void);
WEAK void LP_FLEXCOMM2_IRQHandler(void);
WEAK void LP_FLEXCOMM3_IRQHandler(void);
WEAK void LP_FLEXCOMM4_IRQHandler(void);
WEAK void LP_FLEXCOMM5_IRQHandler(void);
WEAK void LPSPI14_IRQHandler(void);
WEAK void LPI2C15_IRQHandler(void);
WEAK void ADC_IRQHandler(void);
WEAK void SDADC_IRQHandler(void);
WEAK void ACMP_IRQHandler(void);
WEAK void PDM_EVENT_IRQHandler(void);
WEAK void PDM_HWVAD_EVENT_IRQHandler(void);
WEAK void HYPERVISOR_IRQHandler(void);
WEAK void SECURE_VIOLATION_IRQHandler(void);
WEAK void SENSE_HYPERVISOR_IRQHandler(void);
WEAK void SENSE_SECURE_VIOLATION_IRQHandler(void);
WEAK void MEDIA_HYPERVISOR_IRQHandler(void);
WEAK void MEDIA_SECURE_VIOLATION_IRQHandler(void);
WEAK void RTC0_ALARM_IRQHandler(void);
WEAK void RTC0_IRQHandler(void);
WEAK void Reserved44_IRQHandler(void);
WEAK void MU0_A_IRQHandler(void);
WEAK void MU1_A_IRQHandler(void);
WEAK void Reserved47_IRQHandler(void);
WEAK void CTIMER2_IRQHandler(void);
WEAK void CTIMER4_IRQHandler(void);
WEAK void OS_EVENT_IRQHandler(void);
WEAK void LP_FLEXCOMM6_IRQHandler(void);
WEAK void LP_FLEXCOMM7_IRQHandler(void);
WEAK void USDHC0_IRQHandler(void);
WEAK void USDHC1_IRQHandler(void);
WEAK void I3C0_IRQHandler(void);
WEAK void USB0_IRQHandler(void);
WEAK void USB1_IRQHandler(void);
WEAK void WDT0_IRQHandler(void);
WEAK void WDT1_IRQHandler(void);
WEAK void USBPHY0_IRQHandler(void);
WEAK void PUF_IRQHandler(void);
WEAK void Reserved62_IRQHandler(void);
WEAK void LP_FLEXCOMM8_IRQHandler(void);
WEAK void LP_FLEXCOMM9_IRQHandler(void);
WEAK void LP_FLEXCOMM10_IRQHandler(void);
WEAK void LP_FLEXCOMM11_IRQHandler(void);
WEAK void LP_FLEXCOMM12_IRQHandler(void);
WEAK void LP_FLEXCOMM13_IRQHandler(void);
WEAK void LPSPI16_IRQHandler(void);
WEAK void I3C1_IRQHandler(void);
WEAK void FLEXIO_IRQHandler(void);
WEAK void Reserved72_IRQHandler(void);
WEAK void Reserved73_IRQHandler(void);
WEAK void Reserved74_IRQHandler(void);
WEAK void EDMA0_CH0_IRQHandler(void);
WEAK void EDMA0_CH1_IRQHandler(void);
WEAK void EDMA0_CH2_IRQHandler(void);
WEAK void EDMA0_CH3_IRQHandler(void);
WEAK void EDMA0_CH4_IRQHandler(void);
WEAK void EDMA0_CH5_IRQHandler(void);
WEAK void EDMA0_CH6_IRQHandler(void);
WEAK void EDMA0_CH7_IRQHandler(void);
WEAK void EDMA0_CH8_IRQHandler(void);
WEAK void EDMA0_CH9_IRQHandler(void);
WEAK void EDMA0_CH10_IRQHandler(void);
WEAK void EDMA0_CH11_IRQHandler(void);
WEAK void EDMA0_CH12_IRQHandler(void);
WEAK void EDMA0_CH13_IRQHandler(void);
WEAK void EDMA0_CH14_IRQHandler(void);
WEAK void EDMA0_CH15_IRQHandler(void);
WEAK void EDMA1_CH0_IRQHandler(void);
WEAK void EDMA1_CH1_IRQHandler(void);
WEAK void EDMA1_CH2_IRQHandler(void);
WEAK void EDMA1_CH3_IRQHandler(void);
WEAK void EDMA1_CH4_IRQHandler(void);
WEAK void EDMA1_CH5_IRQHandler(void);
WEAK void EDMA1_CH6_IRQHandler(void);
WEAK void EDMA1_CH7_IRQHandler(void);
WEAK void EDMA1_CH8_IRQHandler(void);
WEAK void EDMA1_CH9_IRQHandler(void);
WEAK void EDMA1_CH10_IRQHandler(void);
WEAK void EDMA1_CH11_IRQHandler(void);
WEAK void EDMA1_CH12_IRQHandler(void);
WEAK void EDMA1_CH13_IRQHandler(void);
WEAK void EDMA1_CH14_IRQHandler(void);
WEAK void EDMA1_CH15_IRQHandler(void);
WEAK void GPIO00_IRQHandler(void);
WEAK void GPIO01_IRQHandler(void);
WEAK void GPIO10_IRQHandler(void);
WEAK void GPIO11_IRQHandler(void);
WEAK void GPIO20_IRQHandler(void);
WEAK void GPIO21_IRQHandler(void);
WEAK void GPIO30_IRQHandler(void);
WEAK void GPIO31_IRQHandler(void);
WEAK void GPIO40_IRQHandler(void);
WEAK void GPIO41_IRQHandler(void);
WEAK void GPIO50_IRQHandler(void);
WEAK void GPIO51_IRQHandler(void);
WEAK void GPIO60_IRQHandler(void);
WEAK void GPIO61_IRQHandler(void);
WEAK void GPIO70_IRQHandler(void);
WEAK void GPIO71_IRQHandler(void);
WEAK void PIN_INT0_IRQHandler(void);
WEAK void PIN_INT1_IRQHandler(void);
WEAK void PIN_INT2_IRQHandler(void);
WEAK void PIN_INT3_IRQHandler(void);
WEAK void PIN_INT4_IRQHandler(void);
WEAK void PIN_INT5_IRQHandler(void);
WEAK void PIN_INT6_IRQHandler(void);
WEAK void PIN_INT7_IRQHandler(void);
WEAK void SAI0_IRQHandler(void);
WEAK void SAI1_IRQHandler(void);
WEAK void SAI2_IRQHandler(void);
WEAK void XSPI0_IRQHandler(void);
WEAK void XSPI1_IRQHandler(void);
WEAK void XSPI2_IRQHandler(void);
WEAK void MMU0_IRQHandler(void);
WEAK void MMU1_IRQHandler(void);
WEAK void MMU2_IRQHandler(void);
WEAK void Freqme_IRQHandler(void);
WEAK void GDET0_IRQHandler(void);
WEAK void Reserved142_IRQHandler(void);
WEAK void Reserved143_IRQHandler(void);
WEAK void GDET3_IRQHandler(void);
WEAK void CDOG0_IRQHandler(void);
WEAK void CDOG1_IRQHandler(void);
WEAK void CDOG2_IRQHandler(void);
WEAK void ITRC0_IRQHandler(void);
WEAK void ELS_IRQHandler(void);
WEAK void PKC_IRQHandler(void);
WEAK void OSCCA_IRQHandler(void);
WEAK void SLEEPCON0_IRQHandler(void);
WEAK void CPU0_IRQHandler(void);
WEAK void PMC_IRQHandler(void);
WEAK void Reserved155_IRQHandler(void);
WEAK void Reserved156_IRQHandler(void);
WEAK void NPU_IRQHandler(void);
WEAK void TRNG_IRQHandler(void);
WEAK void TEMPDET0_IRQHandler(void);
WEAK void TEMPDET1_IRQHandler(void);
WEAK void EZHV_IRQHandler(void);
WEAK void GLIKEY0_IRQHandler(void);
WEAK void GLIKEY2_IRQHandler(void);
WEAK void GLIKEY3_IRQHandler(void);
WEAK void GLIKEY5_IRQHandler(void);
WEAK void PVTS0_CPU0_IRQHandler(void);
WEAK void Reserved167_IRQHandler(void);
WEAK void PVTS0_HIFI4_IRQHandler(void);
WEAK void Reserved169_IRQHandler(void);
WEAK void FRO0_IRQHandler(void);
WEAK void FRO1_IRQHandler(void);
WEAK void FRO2_IRQHandler(void);
WEAK void OCOTP_IRQHandler(void);

//*****************************************************************************
// Forward declaration of the driver IRQ handlers. These are aliased
// to the DefaultISR, which is a 'forever' loop. When the driver
// defines a handler (with the same name), this will automatically take
// precedence over these weak definitions
//*****************************************************************************
void Reserved16_DriverIRQHandler(void) ALIAS(DefaultISR);
void UTICK0_DriverIRQHandler(void) ALIAS(DefaultISR);
void MRT0_DriverIRQHandler(void) ALIAS(DefaultISR);
void CTIMER0_DriverIRQHandler(void) ALIAS(DefaultISR);
void CTIMER1_DriverIRQHandler(void) ALIAS(DefaultISR);
void SCT0_DriverIRQHandler(void) ALIAS(DefaultISR);
void CTIMER3_DriverIRQHandler(void) ALIAS(DefaultISR);
void LP_FLEXCOMM0_DriverIRQHandler(void) ALIAS(DefaultISR);
void LP_FLEXCOMM1_DriverIRQHandler(void) ALIAS(DefaultISR);
void LP_FLEXCOMM2_DriverIRQHandler(void) ALIAS(DefaultISR);
void LP_FLEXCOMM3_DriverIRQHandler(void) ALIAS(DefaultISR);
void LP_FLEXCOMM4_DriverIRQHandler(void) ALIAS(DefaultISR);
void LP_FLEXCOMM5_DriverIRQHandler(void) ALIAS(DefaultISR);
void LPSPI14_DriverIRQHandler(void) ALIAS(DefaultISR);
void LPI2C15_DriverIRQHandler(void) ALIAS(DefaultISR);
void ADC_DriverIRQHandler(void) ALIAS(DefaultISR);
void SDADC_DriverIRQHandler(void) ALIAS(DefaultISR);
void ACMP_DriverIRQHandler(void) ALIAS(DefaultISR);
void PDM_EVENT_DriverIRQHandler(void) ALIAS(DefaultISR);
void PDM_HWVAD_EVENT_DriverIRQHandler(void) ALIAS(DefaultISR);
void HYPERVISOR_DriverIRQHandler(void) ALIAS(DefaultISR);
void SECURE_VIOLATION_DriverIRQHandler(void) ALIAS(DefaultISR);
void SENSE_HYPERVISOR_DriverIRQHandler(void) ALIAS(DefaultISR);
void SENSE_SECURE_VIOLATION_DriverIRQHandler(void) ALIAS(DefaultISR);
void MEDIA_HYPERVISOR_DriverIRQHandler(void) ALIAS(DefaultISR);
void MEDIA_SECURE_VIOLATION_DriverIRQHandler(void) ALIAS(DefaultISR);
void RTC0_ALARM_DriverIRQHandler(void) ALIAS(DefaultISR);
void RTC0_DriverIRQHandler(void) ALIAS(DefaultISR);
void Reserved44_DriverIRQHandler(void) ALIAS(DefaultISR);
void MU0_A_DriverIRQHandler(void) ALIAS(DefaultISR);
void MU1_A_DriverIRQHandler(void) ALIAS(DefaultISR);
void Reserved47_DriverIRQHandler(void) ALIAS(DefaultISR);
void CTIMER2_DriverIRQHandler(void) ALIAS(DefaultISR);
void CTIMER4_DriverIRQHandler(void) ALIAS(DefaultISR);
void OS_EVENT_DriverIRQHandler(void) ALIAS(DefaultISR);
void LP_FLEXCOMM6_DriverIRQHandler(void) ALIAS(DefaultISR);
void LP_FLEXCOMM7_DriverIRQHandler(void) ALIAS(DefaultISR);
void USDHC0_DriverIRQHandler(void) ALIAS(DefaultISR);
void USDHC1_DriverIRQHandler(void) ALIAS(DefaultISR);
void I3C0_DriverIRQHandler(void) ALIAS(DefaultISR);
void USB0_DriverIRQHandler(void) ALIAS(DefaultISR);
void USB1_DriverIRQHandler(void) ALIAS(DefaultISR);
void WDT0_DriverIRQHandler(void) ALIAS(DefaultISR);
void WDT1_DriverIRQHandler(void) ALIAS(DefaultISR);
void USBPHY0_DriverIRQHandler(void) ALIAS(DefaultISR);
void PUF_DriverIRQHandler(void) ALIAS(DefaultISR);
void Reserved62_DriverIRQHandler(void) ALIAS(DefaultISR);
void LP_FLEXCOMM8_DriverIRQHandler(void) ALIAS(DefaultISR);
void LP_FLEXCOMM9_DriverIRQHandler(void) ALIAS(DefaultISR);
void LP_FLEXCOMM10_DriverIRQHandler(void) ALIAS(DefaultISR);
void LP_FLEXCOMM11_DriverIRQHandler(void) ALIAS(DefaultISR);
void LP_FLEXCOMM12_DriverIRQHandler(void) ALIAS(DefaultISR);
void LP_FLEXCOMM13_DriverIRQHandler(void) ALIAS(DefaultISR);
void LPSPI16_DriverIRQHandler(void) ALIAS(DefaultISR);
void I3C1_DriverIRQHandler(void) ALIAS(DefaultISR);
void FLEXIO_DriverIRQHandler(void) ALIAS(DefaultISR);
void Reserved72_DriverIRQHandler(void) ALIAS(DefaultISR);
void Reserved73_DriverIRQHandler(void) ALIAS(DefaultISR);
void Reserved74_DriverIRQHandler(void) ALIAS(DefaultISR);
void EDMA0_CH0_DriverIRQHandler(void) ALIAS(DefaultISR);
void EDMA0_CH1_DriverIRQHandler(void) ALIAS(DefaultISR);
void EDMA0_CH2_DriverIRQHandler(void) ALIAS(DefaultISR);
void EDMA0_CH3_DriverIRQHandler(void) ALIAS(DefaultISR);
void EDMA0_CH4_DriverIRQHandler(void) ALIAS(DefaultISR);
void EDMA0_CH5_DriverIRQHandler(void) ALIAS(DefaultISR);
void EDMA0_CH6_DriverIRQHandler(void) ALIAS(DefaultISR);
void EDMA0_CH7_DriverIRQHandler(void) ALIAS(DefaultISR);
void EDMA0_CH8_DriverIRQHandler(void) ALIAS(DefaultISR);
void EDMA0_CH9_DriverIRQHandler(void) ALIAS(DefaultISR);
void EDMA0_CH10_DriverIRQHandler(void) ALIAS(DefaultISR);
void EDMA0_CH11_DriverIRQHandler(void) ALIAS(DefaultISR);
void EDMA0_CH12_DriverIRQHandler(void) ALIAS(DefaultISR);
void EDMA0_CH13_DriverIRQHandler(void) ALIAS(DefaultISR);
void EDMA0_CH14_DriverIRQHandler(void) ALIAS(DefaultISR);
void EDMA0_CH15_DriverIRQHandler(void) ALIAS(DefaultISR);
void EDMA1_CH0_DriverIRQHandler(void) ALIAS(DefaultISR);
void EDMA1_CH1_DriverIRQHandler(void) ALIAS(DefaultISR);
void EDMA1_CH2_DriverIRQHandler(void) ALIAS(DefaultISR);
void EDMA1_CH3_DriverIRQHandler(void) ALIAS(DefaultISR);
void EDMA1_CH4_DriverIRQHandler(void) ALIAS(DefaultISR);
void EDMA1_CH5_DriverIRQHandler(void) ALIAS(DefaultISR);
void EDMA1_CH6_DriverIRQHandler(void) ALIAS(DefaultISR);
void EDMA1_CH7_DriverIRQHandler(void) ALIAS(DefaultISR);
void EDMA1_CH8_DriverIRQHandler(void) ALIAS(DefaultISR);
void EDMA1_CH9_DriverIRQHandler(void) ALIAS(DefaultISR);
void EDMA1_CH10_DriverIRQHandler(void) ALIAS(DefaultISR);
void EDMA1_CH11_DriverIRQHandler(void) ALIAS(DefaultISR);
void EDMA1_CH12_DriverIRQHandler(void) ALIAS(DefaultISR);
void EDMA1_CH13_DriverIRQHandler(void) ALIAS(DefaultISR);
void EDMA1_CH14_DriverIRQHandler(void) ALIAS(DefaultISR);
void EDMA1_CH15_DriverIRQHandler(void) ALIAS(DefaultISR);
void GPIO00_DriverIRQHandler(void) ALIAS(DefaultISR);
void GPIO01_DriverIRQHandler(void) ALIAS(DefaultISR);
void GPIO10_DriverIRQHandler(void) ALIAS(DefaultISR);
void GPIO11_DriverIRQHandler(void) ALIAS(DefaultISR);
void GPIO20_DriverIRQHandler(void) ALIAS(DefaultISR);
void GPIO21_DriverIRQHandler(void) ALIAS(DefaultISR);
void GPIO30_DriverIRQHandler(void) ALIAS(DefaultISR);
void GPIO31_DriverIRQHandler(void) ALIAS(DefaultISR);
void GPIO40_DriverIRQHandler(void) ALIAS(DefaultISR);
void GPIO41_DriverIRQHandler(void) ALIAS(DefaultISR);
void GPIO50_DriverIRQHandler(void) ALIAS(DefaultISR);
void GPIO51_DriverIRQHandler(void) ALIAS(DefaultISR);
void GPIO60_DriverIRQHandler(void) ALIAS(DefaultISR);
void GPIO61_DriverIRQHandler(void) ALIAS(DefaultISR);
void GPIO70_DriverIRQHandler(void) ALIAS(DefaultISR);
void GPIO71_DriverIRQHandler(void) ALIAS(DefaultISR);
void PIN_INT0_DriverIRQHandler(void) ALIAS(DefaultISR);
void PIN_INT1_DriverIRQHandler(void) ALIAS(DefaultISR);
void PIN_INT2_DriverIRQHandler(void) ALIAS(DefaultISR);
void PIN_INT3_DriverIRQHandler(void) ALIAS(DefaultISR);
void PIN_INT4_DriverIRQHandler(void) ALIAS(DefaultISR);
void PIN_INT5_DriverIRQHandler(void) ALIAS(DefaultISR);
void PIN_INT6_DriverIRQHandler(void) ALIAS(DefaultISR);
void PIN_INT7_DriverIRQHandler(void) ALIAS(DefaultISR);
void SAI0_DriverIRQHandler(void) ALIAS(DefaultISR);
void SAI1_DriverIRQHandler(void) ALIAS(DefaultISR);
void SAI2_DriverIRQHandler(void) ALIAS(DefaultISR);
void XSPI0_DriverIRQHandler(void) ALIAS(DefaultISR);
void XSPI1_DriverIRQHandler(void) ALIAS(DefaultISR);
void XSPI2_DriverIRQHandler(void) ALIAS(DefaultISR);
void MMU0_DriverIRQHandler(void) ALIAS(DefaultISR);
void MMU1_DriverIRQHandler(void) ALIAS(DefaultISR);
void MMU2_DriverIRQHandler(void) ALIAS(DefaultISR);
void Freqme_DriverIRQHandler(void) ALIAS(DefaultISR);
void GDET0_DriverIRQHandler(void) ALIAS(DefaultISR);
void Reserved142_DriverIRQHandler(void) ALIAS(DefaultISR);
void Reserved143_DriverIRQHandler(void) ALIAS(DefaultISR);
void GDET3_DriverIRQHandler(void) ALIAS(DefaultISR);
void CDOG0_DriverIRQHandler(void) ALIAS(DefaultISR);
void CDOG1_DriverIRQHandler(void) ALIAS(DefaultISR);
void CDOG2_DriverIRQHandler(void) ALIAS(DefaultISR);
void ITRC0_DriverIRQHandler(void) ALIAS(DefaultISR);
void ELS_DriverIRQHandler(void) ALIAS(DefaultISR);
void PKC_DriverIRQHandler(void) ALIAS(DefaultISR);
void OSCCA_DriverIRQHandler(void) ALIAS(DefaultISR);
void SLEEPCON0_DriverIRQHandler(void) ALIAS(DefaultISR);
void CPU0_DriverIRQHandler(void) ALIAS(DefaultISR);
void PMC_DriverIRQHandler(void) ALIAS(DefaultISR);
void Reserved155_DriverIRQHandler(void) ALIAS(DefaultISR);
void Reserved156_DriverIRQHandler(void) ALIAS(DefaultISR);
void NPU_DriverIRQHandler(void) ALIAS(DefaultISR);
void TRNG_DriverIRQHandler(void) ALIAS(DefaultISR);
void TEMPDET0_DriverIRQHandler(void) ALIAS(DefaultISR);
void TEMPDET1_DriverIRQHandler(void) ALIAS(DefaultISR);
void EZHV_DriverIRQHandler(void) ALIAS(DefaultISR);
void GLIKEY0_DriverIRQHandler(void) ALIAS(DefaultISR);
void GLIKEY2_DriverIRQHandler(void) ALIAS(DefaultISR);
void GLIKEY3_DriverIRQHandler(void) ALIAS(DefaultISR);
void GLIKEY5_DriverIRQHandler(void) ALIAS(DefaultISR);
void PVTS0_CPU0_DriverIRQHandler(void) ALIAS(DefaultISR);
void Reserved167_DriverIRQHandler(void) ALIAS(DefaultISR);
void PVTS0_HIFI4_DriverIRQHandler(void) ALIAS(DefaultISR);
void Reserved169_DriverIRQHandler(void) ALIAS(DefaultISR);
void FRO0_DriverIRQHandler(void) ALIAS(DefaultISR);
void FRO1_DriverIRQHandler(void) ALIAS(DefaultISR);
void FRO2_DriverIRQHandler(void) ALIAS(DefaultISR);
void OCOTP_DriverIRQHandler(void) ALIAS(DefaultISR);

//*****************************************************************************
// The entry point for the application.
// __main() is the entry point for Redlib based applications
// main() is the entry point for Newlib based applications
//*****************************************************************************
#if defined(__MCUXPRESSO)
#if defined(__REDLIB__)
extern void __main(void);
#else
extern int main(void);
#endif //(__REDLIB__)
#elif defined(__ICCARM__)
extern void __iar_program_start(void);
#elif defined(__GNUC__)
#if defined(__REDLIB__)
extern void __main(void);
#else
extern void _start(void);
#endif //(__REDLIB__)
#else
#error Unsupported toolchain!
#endif //(__MCUXPRESSO)

//*****************************************************************************
// External declaration for the pointer from the Linker Script
//*****************************************************************************
#if defined(__CC_ARM) || defined(__ARMCC_VERSION)
extern uint32_t Image$$ARM_LIB_STACK$$ZI$$Base[];
extern uint32_t Image$$ARM_LIB_STACK$$ZI$$Limit[];
#define _vStackTop  Image$$ARM_LIB_STACK$$ZI$$Limit
#define _vStackBase Image$$ARM_LIB_STACK$$ZI$$Base
extern uint32_t Load$$LR$$LR_m_interrupts$$Length[];
#define _image_size Load$$LR$$LR_m_interrupts$$Length
#elif defined(__MCUXPRESSO)
extern void _vStackTop(void);
extern void _vStackBase(void);
extern void _image_size(void);
#define Reset_Handler ResetISR // To be compatible with other compilers
#elif defined(__ICCARM__)
#pragma segment = "CSTACK"
#define _vStackTop  __section_end("CSTACK")
#define _vStackBase __section_begin("CSTACK")
#pragma segment = "RO"
#define _image_size __section_size("RO")
#elif defined(__GNUC__)
extern uint32_t __StackTop[];
extern uint32_t __StackLimit[];

